Reddit/app/models/user.rb

def self.find_by_credentials(username, password)

    User = User.find_by(username: username)
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "iluvHTML"], ["LIMIT", 1]]

def reset_session_token

self.session_token = generate_session_token

self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2023-04-21 19:39:48.110329"], ["id", 1]]