Reddit/app/controllers/application_controller.rb

    def current_user

        @surrent_user = User.find_by(session_token: session[:session_token])
---
SELECT "users".* FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]